Tekla Open API Reference for Tekla Structures 2025
LineTypes.SlashedLine Field
 The slashed line (- - -).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static readonly LineTypes SlashedLine
Public Shared ReadOnly SlashedLine As LineTypes
Field Value
Type: LineTypes
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace